package com.mohammadmawed.azkarapp.data

import androidx.room.Database
import androidx.room.RoomDatabase
import androidx.sqlite.db.SupportSQLiteDatabase
import com.mohammadmawed.azkarapp.di.ApplicationScope
import com.mohammadmawed.azkarapp.util.Constants
import kotlinx.coroutines.CoroutineScope
import kotlinx.coroutines.launch
import javax.inject.Inject
import javax.inject.Provider

@Database(entities = [Zikr::class], version = Constants.DATABASE_VERSION)

abstract class ZikrDatabase : RoomDatabase() {

    abstract fun zikrDao(): ZikrDao

    class CallBack @Inject constructor(
        private val database: Provider<ZikrDatabase>,
        @ApplicationScope private val appScope: CoroutineScope
    ) : RoomDatabase.Callback() {

        override fun onCreate(db: SupportSQLiteDatabase) {
            super.onCreate(db)

            //Database ops
            val zikrDao = database.get().zikrDao()

            appScope.launch {
                zikrDao.addZikr(
                    Zikr(
                        1,
                        "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ \n" +
                                "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].",
                        "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.",
                        1,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        2,
                        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                                "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.",
                        "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        3,
                        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                                "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. ",
                        "",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        4,
                        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                                "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ",
                        "",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        5,
                        "أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر.",
                        "",
                        1,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        6,
                        "أاللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
                        "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
                        1,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        7,
                        "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً. ",
                        "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        8,
                        "اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
                        "من قالها أعتقه الله من النار.",
                        4,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        9,
                        "اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر.",
                        "من قالها حين يصبح أدى شكر يومه.",
                        1,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        10,
                        "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
                        "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.",
                        7,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        11,
                        "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
                        "لم يضره من الله شيء.",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        12,
                        "اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور.",
                        "",
                        1,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        13,
                        "أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.",
                        "",
                        1,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        14,
                        "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
                        "",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        15,
                        "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
                        "",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        16,
                        "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
                        "",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        17,
                        "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
                        "",
                        1,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        18,
                        "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
                        "",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        19,
                        "أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ، وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.",
                        "",
                        1,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        20,
                        "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
                        "",
                        1,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        21,
                        "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
                        "",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        22,
                        "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
                        "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
                        10,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        23,
                        "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
                        "",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        24,
                        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
                        "",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        25,
                        "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
                        "",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        26,
                        "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
                        "",
                        3,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        27,
                        "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.",
                        "",
                        1,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        28,
                        "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
                        "ذكر طيب.",
                        1,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        29,
                        "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
                        "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
                        100,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        30,
                        "سُبْحـانَ اللهِ وَبِحَمْـدِهِ. ",
                        "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
                        100,
                        alsabah = false,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        31,
                        "أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ، لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. ",
                        "",
                        1,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        32,
                        "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\n" +
                                "آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286].",
                        "من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.",
                        1,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        33,
                        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                                "قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ. ",
                        "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        34,
                        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                                "قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. ",
                        "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        35,
                        "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم\n" +
                                "قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ، إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.",
                        "من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين). ",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        36,
                        "أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ\n" +
                                "                                اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255].",
                        "من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.",
                        1,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        37,
                        "اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ .",
                        "من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.",
                        1,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        38,
                        "رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً.",
                        "من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        39,
                        "اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ، وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك.",
                        "من قالها أعتقه الله من النار. ",
                        4,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        40,
                        "اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. ",
                        "من قالها حين يمسى أدى شكر يومه.",
                        1,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        41,
                        "حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم.",
                        "من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة. ",
                        7,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        42,
                        "بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم.",
                        "لم يضره من الله شيء.",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        43,
                        "اللّهُـمَّ بِكَ أَمْسَـينا وَبِكَ أَصْـبَحْنا، وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ الْمَصِيرُ.",
                        "",
                        1,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        44,
                        "أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ ",
                        "",
                        1,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        45,
                        "سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ، وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ، وَمِـدادَ كَلِمـاتِـه.",
                        "",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        46,
                        "اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ، اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ.",
                        "",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        47,
                        "اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ، وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر ، لا إلهَ إلاّ أَنْـتَ.",
                        "",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        48,
                        "اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة ، اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي ، اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.",
                        "",
                        1,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        49,
                        "يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.",
                        "",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        50,
                        "أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، ونُوْرَهَا وبَرَكَتهَا، وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا.",
                        "",
                        1,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        51,
                        "اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ، أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ، وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.",
                        "" ,
                        1,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        52,
                        "أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق.",
                        "",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        53,
                        "اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد.",
                        "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
                        10,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        54,
                        "اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.",
                        "",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        55,
                        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ، وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ، وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ، وَقَهْرِ الرِّجَالِ.",
                        "",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        56,
                        "أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.",
                        "",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        57,
                        "يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ , وَلِعَظِيمِ سُلْطَانِكَ.",
                        "",
                        3,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        58,
                        "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ.",
                        "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
                        100,
                        alsabah = true,
                        wasRead = false
                    )
                )

                zikrDao.addZikr(
                    Zikr(
                        59,
                        "اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ.",
                        "ذكر طيب.",
                        1,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        60,
                        "سُبْحـانَ اللهِ وَبِحَمْـدِهِ.",
                        "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
                        100,
                        alsabah = true,
                        wasRead = false
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        61,
                        "سَمِعَ النَّبِيُّ ﷺ رَجُلًا يَقُولُ: \"اللَّهُمَّ إِنِّي أَسْأَلُكَ بِأَنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ لَا إِلَهَ إِلَّا أَنْتَ، الأَحَدُ الصَّمَدُ، الَّذِي لَمْ يَلِدْ، وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ\"، فَقَالَ: لَقَدْ سَأَلَ اللَّهَ بِاسْمِهِ الَّذِي إِذَا سُئِلَ بِهِ أَعْطَى، وَإِذَا دُعِيَ بِهِ أَجَابَ.",
                        "",
                        1,
                        alsabah = true,
                        wasRead = true
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        62,
                        "عن أحمد عن أنس بن مالك قال: جاءت أم سليم إلى النبي صلى الله عليه وسلم، فقالت: يا رسول الله، علمني كلمات أدعو بهن، قال: «تسبحين الله عشرًا، وتحمدينه عشرًا، وتكبرينه عشرًا، ثم سلي حاجتك، فإنه يقول: قد فعلت، قد فعلت.",
                        "",
                        1,
                        alsabah = true,
                        wasRead = true
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        63,
                        "سمعتُ النبيَّ صلَّى اللهُ عليه وسلم يقولُ في بعضِ صلاتهِ : اللهمَّ حاسِبني حسابًا يسيرًا.",
                        " فلمَّا انصرف قلتُ : يا نبيَّ اللهِ ما الحسابُ اليسيرُ ؟ قال : أنْ ينظرَ في كتابهِ فيتجاوزَ عنه ، إنَّه من نوقِشَ الحسابَ يومئذٍ يا عائشةُ هلكَ ، وكلُّ ما يصيبُ المؤمِنَ يكفِّرُ الله عزَّ وجلَّ به عنه حتَّى الشوكةُ تشوكهُ.",
                        1,
                        alsabah = true,
                        wasRead = true
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        64,
                        "عَن النَّبيّ ﷺ قَالَ: مَنْ قالَ لا إلهَ إلاَّ اللَّه وحْدهُ لاَ شَرِيكَ لهُ، لَهُ المُلْكُ، ولَهُ الحمْدُ، وَهُو عَلَى كُلِّ شَيءٍ قَدِيرٌ، عشْر مرَّاتٍ، كَانَ كَمَنْ أَعْتَقَ أرْبعةَ أَنفُسٍ مِن وَلدِ إسْماعِيلَ.ُ",
                        "",
                        10,
                        alsabah = true,
                        wasRead = true
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        65,
                        " قال رسول الله - صلى الله عليه وسلم -: مَنْ قَالَ حِينَ يَسْمَعُ الْمُؤَذِّنَ: أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ رَضِيتُ بِاللَّهِ رَبًّا وَبِمُحَمَّدٍ رَسُولًا وَبِالْإِسْلَامِ دِينًا غُفِرَ لَهُ ذَنْبُه .ٌُُ",
                        "ورد من الأذكار التي تغفر الذنوب دعاء يقال عند الأذان حيث قال رسول الله.",
                        1,
                        alsabah = true,
                        wasRead = true
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        66,
                        "قال رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ:  مَنْ سَبَّحَ اللهَ فِي دُبُرِ كُلِّ صَلَاةٍ ثَلَاثًا وَثَلَاثِينَ، وَحَمِدَ اللهَ ثَلَاثًا وَثَلَاثِينَ، وَكَبَّرَ اللهَ ثَلَاثًا وَثَلَاثِينَ، فَتْلِكَ تِسْعَةٌ وَتِسْعُونَ، وَقَالَ تَمَامَ الْمِائَةِ: لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ غُفِرَتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْر .ٌُِ",
                        "",
                        1,
                        alsabah = true,
                        wasRead = true
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        67,
                        "قال رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَنْ تَعَارَّ مِنْ اللَّيْلِ فَقَالَ: لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، الْحَمْدُ لِلَّهِ، وَسُبْحَانَ اللَّهِ، وَلَا إِلَهَ إِلَّا اللَّهُ، وَاللَّهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ، ثُمَّ قَالَ: اللَّهُمَّ اغْفِرْ لِي أَوْ دَعَا، اسْتُجِيبَ لَهُ، فَإِنْ تَوَضَّأَ وَصَلَّى قُبِلَتْ صَلَاتُه .ُ",
                        "",
                        1,
                        alsabah = true,
                        wasRead = true
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        68,
                        "قال رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: مَنْ قَالَ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ فِي يَوْمٍ مِائَةَ مَرَّةٍ حُطَّتْ خَطَايَاهُ وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْر.",
                        "",
                        100,
                        alsabah = true,
                        wasRead = true
                    )
                )
                zikrDao.addZikr(
                    Zikr(
                        69,
                        "قال رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ:  مَنْ نَفَّسَ عَنْ مُؤْمِنٍ كُرْبَةً مِنْ كُرَبِ الدُّنْيَا نَفَّسَ اللَّهُ عَنْهُ كُرْبَةً مِنْ كُرَبِ يَوْمِ الْقِيَامَةِ، وَمَنْ يَسَّرَ عَلَى مُعْسِرٍ يَسَّرَ اللَّهُ عَلَيْهِ فِي الدُّنْيَا وَالْآخِرَةِ، وَمَنْ سَتَرَ مُسْلِمًا سَتَرَهُ اللَّهُ فِي الدُّنْيَا وَالْآخِرَةِ، وَاللَّهُ فِي عَوْنِ الْعَبْدِ مَا كَانَ الْعَبْدُ فِي عَوْنِ أَخِيهِ، وَمَنْ سَلَكَ طَرِيقًا يَلْتَمِسُ فِيهِ عِلْمًا سَهَّلَ اللَّهُ لَهُ بِهِ طَرِيقًا إِلَى الْجَنَّةِ، وَمَا اجْتَمَعَ قَوْمٌ فِي بَيْتٍ مِنْ بُيُوتِ اللَّهِ يَتْلُونَ كِتَابَ اللَّهِ وَيَتَدَارَسُونَهُ بَيْنَهُمْ، إِلَّا نَزَلَتْ عَلَيْهِمُ السَّكِينَةُ، وَغَشِيَتْهُمُ الرَّحْمَةُ، وَحَفَّتْهُمُ الْمَلَائِكَةُ، وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ، وَمَنْ بَطَّأَ بِهِ عَمَلُهُ لَمْ يُسْرِعْ بِهِ نَسَبُهُ.",
                        "",
                        1,
                        alsabah = true,
                        wasRead = true
                    )
                )
            }
        }
    }
}